/*C**************************************************************************
* NAME:   timer_drv.c
*----------------------------------------------------------------------------
* Copyright (c) 2011.
*----------------------------------------------------------------------------
* RELEASE:      2011.01.13
* REVISION:     1.0     
*----------------------------------------------------------------------------
* PURPOSE:
* This file contains the timer0 & timer1 driver routines.
*
* NOTES:   若T0用于调度器, 则在scheduler.c 中初始化和定义中断函数
*****************************************************************************/


/*_____ I N C L U D E S ____________________________________________________*/
#include "config.h"            /* lib configuration header */
#include "timer_drv.h"         /* timer driver definition */



/*F***************************************************************************
* NAME:  t0_set_prio
*-----------------------------------------------------------------------------
* PARAMS:  priority ： 优先级值, 范围 0 ~ 3
* return:
*----------------------------------------------------------------------------
* PURPOSE: Set the Timer0 interrupt priority 
*----------------------------------------------------------------------------
* REQUIREMENTS:
******************************************************************************/
void t0_set_prio(Byte priority)
{
  PT0 =  0;       //复位至优先值0
  IPH &= ~PT0H_;

  if ((priority == 1) || (priority == 3))     // set LOW priority bit
  {
    PT0 = 1;
  }
  if ((priority == 2) || (priority == 3))     // set HIGH priority bit
  {
    IPH |= PT0H_;
  }
}


/*F***************************************************************************
* NAME:  t1_set_prio
*-----------------------------------------------------------------------------
* PARAMS:  priority ： 优先级值
* return:
*----------------------------------------------------------------------------
* PURPOSE: Set the Timer1 interrupt priority 
*----------------------------------------------------------------------------
* REQUIREMENTS:
******************************************************************************/
/*
void t1_set_prio(Byte priority)
{
  PT1 =  0;        //复位至优先值0
  IPH &= ~PT1H_;

  if ((priority == 1) || (priority == 3))     // set LOW priority bit
  {
    PT1 = 1;
  }
  if ((priority == 2) || (priority == 3))     // set HIGH priority bit
  {
    IPH |= PT1H_;
  }
}
*/


/*F**************************************************************************
* NAME: timer_init
*----------------------------------------------------------------------------
* PARAMS:
* return:
*----------------------------------------------------------------------------
* PURPOSE: 
*   Timer0, Timer1 initial routine 
*----------------------------------------------------------------------------
* REQUIREMENTS:
*****************************************************************************/
/*
void timer_init(void)
{
  //For T0
	T0_stop();                				    // stops Timer 0
  T0_init(T0_NOT_GATED,T0_TIMER,T0_MODE_1);   // setup Timer 0 as a 16-bit timer                           		
	TL0 = 0; 	                                // loads the timer counts
	TH0 = 0;    
  t0_set_prio(T0_PRIO);                       // set interrupt prio       
  T0_enable_int();          

  //For T1
	T1_stop();                				    // stops Timer 1
  T1_init(T1_NOT_GATED,T1_TIMER,T1_MODE_1);   // setup Timer 1 as a 16-bit timer                           		
	TL1 = 0; 	                                // loads the timer counts
	TH1 = 0;          
  t1_set_prio(T1_PRIO);                       // set interrupt prio   
  T1_enable_int(); 
}
*/


/*F**************************************************************************
* NAME: ISR_T0
*----------------------------------------------------------------------------
* PARAMS:
* return:
*----------------------------------------------------------------------------
* PURPOSE: 
*   Timer0 interrupt service routine 
*----------------------------------------------------------------------------
* REQUIREMENTS:
*****************************************************************************/
/*
void ISR_T0(void) interrupt TF0_VECTOR
{
  //TF0= 0;            // Clear TCON.5 interrupt Flag by hardware automaticaly
	                     // 也可由程序查询或清0
	//T0_stop();         // stop timer0
	//TL0 = ;
	//TH0 = ;
	//T0_start();	     // restart Timer 0
}
*/


/*F**************************************************************************
* NAME: ISR_T1
*----------------------------------------------------------------------------
* PARAMS:
* return:
*----------------------------------------------------------------------------
* PURPOSE: 
*   Timer1 interrupt service routine 
*----------------------------------------------------------------------------
* REQUIREMENTS:
*****************************************************************************/
/*
void ISR_T1(void) interrupt TF1_VECTOR
{
  //TF1= 0;           // Clear TCON.7 interrupt Flag by hardware automaticaly
	                    // 也可由程序查询或清0
}
*/
