/*H**************************************************************************
* NAME:   wdt_drv.h
*----------------------------------------------------------------------------
* Copyright (c) 2011.
*----------------------------------------------------------------------------
* RELEASE:      2011.01.17
* REVISION:     1.0
*----------------------------------------------------------------------------
* PURPOSE:
*   This file contains the Watchdog Timer driver definition.
*****************************************************************************/

#ifndef _WDT_DRV_H_
#define _WDT_DRV_H_


/*_____ I N C L U D E S ____________________________________________________*/
#include "lib_mcu\regs52.h"        /* SFR definition */


/*_____ D E C L A R A T I O N ______________________________________________*/
#define Wdt_enable()    (WDT_CONTR = 0x36)    //直接赋值, 2.2s
#define Wdt_refresh()   (WDT_CONTR = 0x36)    //直接赋值, 2.2s

                         //当主频为 11.0592MHz 时
						 //   0x31 - 使能和清除看门狗,空闲时不计数，溢出时间为142ms.
						 //   0x32 - 使能和清除看门狗,空闲时不计数，溢出时间为284ms.
						 //   0x33 - 使能和清除看门狗,空闲时不计数，溢出时间为569ms.
						 //   0x34 - 使能和清除看门狗,空闲时不计数，溢出时间为1.13s.
						 //   0x35 - 使能和清除看门狗,空闲时不计数，溢出时间为2.27s.
             //   0x36 - 使能和清除看门狗,空闲时不计数，溢出时间为4.5s.
						 //   0x37 - 使能和清除看门狗,空闲时不计数，溢出时间为9s.

                         //当主频为 22.1184MHz 时
						 //   0x31 - 使能和清除看门狗,空闲时不计数，溢出时间为71ms.
						 //   0x32 - 使能和清除看门狗,空闲时不计数，溢出时间为142ms.
						 //   0x33 - 使能和清除看门狗,空闲时不计数，溢出时间为284ms.
						 //   0x34 - 使能和清除看门狗,空闲时不计数，溢出时间为556s.
						 //   0x35 - 使能和清除看门狗,空闲时不计数，溢出时间为1.13s.
             //   0x36 - 使能和清除看门狗,空闲时不计数，溢出时间为2.2s.
						 //   0x37 - 使能和清除看门狗,空闲时不计数，溢出时间为4.5s.


#endif  /* _WDT_DRV_H_ */
